# ENVIRONMENT

In [1]:
import os
import acquire
import pandas as pd

# ACQUIRE

In [2]:
df1 = acquire.read_data('data08.csv')
df2 = acquire.read_data('data10.csv')
df3 = acquire.join_data('data08.csv', 'data10.csv')

In [3]:
df1.head()

,CASEID,MARITAL,B1AGE,AGEDISP,RACER,SEX_N,AGE_N,RACE_N,HSPNC_N,OTHERR_N,...,REASONR5,CHILDCB,L28KIDSN,KIDSNUM,FOSTER_N,KIDLIV_N,KIDIV2_N,DECEASED,STDETAI,STEPCHIL
0,108395,1,18,4,1,1,23,1,1,1,...,9999,0,3,999,9999,777,9999,0,1,1
1,108397,999,30,4,9,1,36,1,1,1,...,9999,0,3,999,9999,777,9999,0,2,2
2,108399,1,27,1,1,1,29,1,1,1,...,9999,0,1,2,9999,1,9999,0,1,1
3,108443,1,19,1,1,1,22,1,1,1,...,9999,0,3,999,9999,777,9999,0,2,2
4,108444,1,18,1,1,1,21,1,1,1,...,9999,1,1,1,9999,1,9999,0,5,2

In [4]:
df2.head()

,CASEID,INVIEWN,IDINCID,INCIDENT,FORCED,YEAR,MONTH,DAY,DATECERT,USOBJ,...,NDRUGS,BOTHDRUG,SUBSTANC,SEVEREST,TOINC,INTYEAR,INTMONTH,INTDAY,DAYSTOIN,DATECOM
0,108395,1,108395000,2,0,1997,12,15,2,2,...,0,0,1,2,1,1998,1,27,43,1
1,108397,1,108397000,1,0,1997,6,28,2,2,...,0,0,2,4,2,1998,1,27,213,1
2,108397,1,108397000,4,0,1998,1,20,2,1,...,0,0,2,4,999,1998,1,27,7,1
3,108399,1,108399000,1,0,1998,1,3,2,2,...,0,0,1,3,2,1998,1,30,27,1
4,108399,1,108399000,3,0,1998,1,27,2,2,...,0,0,1,3,999,1998,1,30,3,1

In [5]:
df3.head()

,CASEID,MARITAL,B1AGE,AGEDISP,RACER,SEX_N,AGE_N,RACE_N,HSPNC_N,OTHERR_N,...,NDRUGS,BOTHDRUG,SUBSTANC,SEVEREST,TOINC,INTYEAR,INTMONTH,INTDAY,DAYSTOIN,DATECOM
0,108395,1,18,4,1,1,23,1,1,1,...,0,0,1,2,1,1998,1,27,43,1
1,108397,999,30,4,9,1,36,1,1,1,...,0,0,2,4,2,1998,1,27,213,1
2,108397,999,30,4,9,1,36,1,1,1,...,0,0,2,4,999,1998,1,27,7,1
3,108399,1,27,1,1,1,29,1,1,1,...,0,0,1,3,2,1998,1,30,27,1
4,108399,1,27,1,1,1,29,1,1,1,...,0,0,1,3,999,1998,1,30,3,1